return {
{
    "folke/snacks.nvim",
    opts = {
      dashboard = {
        enabled = true, -- اطمینان از فعال بودن داشبورد
        width = 40,
        row = nil, -- مرکز عمودی
        col = nil, -- مرکز افقی
        pane_gap = 0, -- مقدار صریح برای pane_gap
        autokeys = "1234567890abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ",
        preset = {
          pick = nil, -- استفاده از پیکر پیش‌فرض
          keys = {
            { icon = " ", key = "f", desc = "Find File", action = ":lua Snacks.dashboard.pick('files')" },
            { icon = " ", key = "n", desc = "New File", action = ":ene | startinsert" },
            { icon = " ", key = "g", desc = "Find Text", action = ":lua Snacks.dashboard.pick('live_grep')" },
            { icon = " ", key = "r", desc = "Recent Files", action = ":lua Snacks.dashboard.pick('oldfiles')" },
            {
              icon = " ",
              key = "c",
              desc = "Config",
              action = ":lua Snacks.dashboard.pick('files', {cwd = vim.fn.stdpath('config')})",
            },
            { icon = " ", key = "s", desc = "Restore Session", section = "session" },
            { icon = "󰒲 ", key = "L", desc = "Lazy", action = ":Lazy", enabled = package.loaded.lazy ~= nil },
          },
          header = [[
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⣀⡀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣷⣤⡀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⣿⣿⣷⣦⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣶⣿⣿⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀
⠀⠀⠀⠀⢀⣼⣿⣿⣿⣿⣿⡿⠟⠉⠀⠀⠈⠛⠿⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀
⠀⠀⠀⣰⣿⣿⣿⣿⣿⡿⠋⠀⠀⠀⣴⣆⠀⠀⠀⠈⠻⣿⣿⣿⣿⣿⣷⡀⠀⠀
⠀⢠⣾⣿⣿⣿⣿⣿⡏⠀⠀⠀⢠⣾⣿⣿⣷⣄⠀⠀⠀⠹⣿⣿⣿⣿⣿⣿⠆⠀
⠀⠀⠉⠻⣿⣿⣿⣿⠀⠀⠀⢰⣿⣿⣿⣿⣿⣿⠆⠀⠀⠀⣿⣿⣿⣿⠟⠁⠀⠀
⠀⠀⠀⠀⠈⣿⣿⣿⠀⠀⠀⠀⠙⢿⣿⣿⡿⠋⠀⠀⠀⠀⣿⣿⡿⠋⠀⠀⠀⠀
⠀⣄⡀⠀⠀⣿⣿⣿⡀⠀⠀⠀⠀⠈⠻⠟⠀⠀⠀⠀⠀⢠⣿⣿⡇⠀⠀⢀⣠⠖
⠀⠹⣿⣷⣶⣿⣿⣿⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⣿⣿⣿⣿⣿⠏⠀
⠀⠀⠘⢿⣿⣿⣿⣿⣿⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⣿⣿⣿⣿⣿⠋⠀⠀
⠀⠀⠀⠈⠋⠁⠀⠀⠈⠻⣷⡀⠀⠀⠀⠀⠀⠀⢠⣿⠏⠁⠀⠀⠈⠙⠃⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣷⡀⠀⠀⠀⠀⢀⣿⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣷⠀⠀⠀⠀⣸⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⠀⠀⠀⠀⣿⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠠⣤⣴⣿⣿⠀⠀⠀⠀⣿⣿⣦⣤⡴⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣿⣿⣿⠀⠀⠀⠀⣿⣿⣿⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣿⣿⠀⠀⠀⠀⣿⣿⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣿⠀⠀⠀⠀⣿⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⠀⠀⠀⠀⠹⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠠⣤⣤⣤⡄⠀⠀⢀⠀⠀⠠⣤⣤⣤⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⢹⣿⣿⡇⠀⠀⣸⡄⠀⢠⣿⣿⡟⠀⠀⠀⣀⠀⠀⠀⠀⢀⣄⠀⠀⠀⠀⣠⣾⣿⣿⣷⣄⠀⢀⣠⣄⠀⠀⠀⠀⠀⠀⣀⣤⠀⠀⠀⠀⣀⣴⣄⣀⣀⣀⣀⣀⣀⡀
⠀⠀⣿⣿⣿⠀⢀⣿⣇⠀⢸⣿⣿⠃⣠⣴⣿⣿⠀⢀⣤⣾⣿⣿⣷⣄⠀⠀⣿⣿⡏⠈⠛⣭⣶⣿⣿⣿⣷⡀⠀⠠⣴⣿⣿⣿⠀⢀⣤⣾⣿⡿⣿⣿⣿⣿⣿⣿⣿⡇
⠀⠀⢹⣿⣿⡄⢸⣿⣿⡀⣿⣿⣿⠀⣸⣿⣿⣿⡄⠈⢹⣿⣿⡝⣿⣿⣷⡄⣿⣿⡇⠀⠀⠀⣿⣿⡏⣻⣿⣿⡦⠀⣿⣿⣿⣿⡄⠈⠙⣿⣿⠀⠀⠁⠀⣿⣿⡇⠀⠁
⠀⠀⠈⣿⣿⣧⣿⣿⣿⣧⣿⣿⡏⠀⣿⡿⢸⣿⣷⣀⣸⣿⣿⣿⣿⡿⠋⠀⣿⣿⡇⠀⠀⠀⣿⣿⣿⣿⣿⠟⠀⢰⣿⣇⣸⣿⣷⣶⠆⣿⣿⣿⣿⡇⠀⣿⣿⡇⠀⠀
⠀⠀⠀⢻⣿⣿⣿⡏⣿⣿⣿⣿⠇⢸⣿⣷⡿⢿⣿⡏⢹⣿⣿⣿⣿⣷⣦⠀⣿⣿⡇⠀⠀⠀⣿⣿⡿⢿⣿⣷⠆⣼⣿⣿⠟⢿⣿⡆⠀⣿⣿⠉⠉⠃⠀⣿⣿⡇⠀⠀
⠀⠀⠀⠘⣿⣿⣿⠁⢻⣿⣿⣿⠀⣼⣿⠋⠀⢸⣿⣷⢸⣿⣿⡇⢸⣿⣿⠀⣿⣿⡇⢀⣤⡄⣿⣿⡇⠸⣿⣿⣁⣿⡟⠁⠀⢸⣿⣷⢀⣿⣿⠀⠀⠀⠀⣿⣿⡇⠀⠀
⠀⠀⠀⠼⠿⠿⠿⠄⠼⠿⠿⠿⠴⠿⠿⠦⠀⠾⠿⠿⠿⠿⠿⠧⠈⠻⠿⠦⠹⣿⣿⣿⣿⠿⠿⠿⠿⠄⠙⠿⠿⠿⠿⠆⠀⠾⠿⠿⠿⠿⠿⠧⠀⠀⠴⠿⠿⠿⠄⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀]],
        },
        
        sections = {
          { section = "header", },
          { section = "keys", gap = 0, padding = 0 },
        },
      },
    },
    config = function(_, opts)
      -- اطمینان از تنظیم pane_gap پیش‌فرض در صورت nil بودن
      opts.dashboard.pane_gap = opts.dashboard.pane_gap or 4
      require("snacks").setup(opts)
    end,
  },
}
